ICinar/autebest_car/src/demos/car/app2/stm32f4xx_spi_bsp.c
    /* Get the I2SCFGR register value */
    tmpreg = SPIx->I2SCFGR;

    /* If the default value has to be written, reinitialize i2sdiv and i2sodd*/
    if (I2S_InitStruct->I2S_AudioFreq == I2S_AudioFreq_Default) {
        i2sodd = (uint16_t) 0;
        i2sdiv = (uint16_t) 2;
    }/* If the requested audio frequency is not the default, compute the prescaler */
    else {
        /* Check the frame length (For the Prescaler computing) *******************/
        if (I2S_InitStruct->I2S_DataFormat == I2S_DataFormat_16b) {
            /* Packet length is 16 bits */
            packetlength = 1;
        } else {
            /* Packet length is 32 bits */
            packetlength = 2;
        }

        /* Get I2S source Clock frequency  ****************************************/

        /* If an external I2S clock has to be used, this define should be set  
           in the project configuration or in the stm32f4xx_conf.h file */
#ifdef I2S_EXTERNAL_CLOCK_VAL     
        /* Set the I2S clock to the external clock  value */
        i2sclk = I2S_EXTERNAL_CLOCK_VAL;

#else /* There is no define for External I2S clock source */
		
        /* Get the PLLI2SN value */
        plln = (uint32_t) (((RCC->PLLI2SCFGR & RCC_PLLI2SCFGR_PLLI2SN) >> 6) & \
                      (RCC_PLLI2SCFGR_PLLI2SN >> 6));

        /* Get the PLLI2SR value */
        pllr = (uint32_t) (((RCC->PLLI2SCFGR & RCC_PLLI2SCFGR_PLLI2SR) >> 28) & \
                      (RCC_PLLI2SCFGR_PLLI2SR >> 28));

        /* Get the PLLM value */
        pllm = (uint32_t) (RCC->PLLCFGR & RCC_PLLCFGR_PLLM);

        /* Get the I2S source clock value */
        i2sclk = (uint32_t) (((HSE_VALUE / pllm) * plln) / pllr);
#endif /* I2S_EXTERNAL_CLOCK_VAL */

        /* Compute the Real divider depending on the MCLK output state, with a floating point */
        if (I2S_InitStruct->I2S_MCLKOutput == I2S_MCLKOutput_Enable) {
            /* MCLK output is enabled */
            tmp = (uint16_t) (((((i2sclk / 256) * 10) / I2S_InitStruct->I2S_AudioFreq)) + 5);
        } else {
            /* MCLK output is disabled */
            tmp = (uint16_t) (((((i2sclk / (32 * packetlength)) *10) / I2S_InitStruct->I2S_AudioFreq)) + 5);
        }

        /* Remove the flatting point */
        tmp = tmp / 10;

        /* Check the parity of the divider */
        i2sodd = (uint16_t) (tmp & (uint16_t) 0x0001);

        /* Compute the i2sdiv prescaler */
        i2sdiv = (uint16_t) ((tmp - i2sodd) / 2);

        /* Get the Mask for the Odd bit (SPI_I2SPR[8]) register */
        i2sodd = (uint16_t) (i2sodd << 8);
    }

    /* Test if the divider is 1 or 0 or greater than 0xFF */
    if ((i2sdiv < 2) || (i2sdiv > 0xFF)) {
        /* Set the default values */
        i2sdiv = 2;
        i2sodd = 0;
    }

    /* Write to SPIx I2SPR register the computed value */
    SPIx->I2SPR = (uint16_t) ((uint16_t) i2sdiv | (uint16_t) (i2sodd | (uint16_t) I2S_InitStruct->I2S_MCLKOutput));

    /* Configure the I2S with the SPI_InitStruct values */
    tmpreg |= (uint16_t) ((uint16_t) SPI_I2SCFGR_I2SMOD | (uint16_t) (I2S_InitStruct->I2S_Mode | \
                  (uint16_t) (I2S_InitStruct->I2S_Standard | (uint16_t) (I2S_InitStruct->I2S_DataFormat | \
                  (uint16_t) I2S_InitStruct->I2S_CPOL))));

    /* Write to SPIx I2SCFGR */
    SPIx->I2SCFGR = tmpreg;
}

/**
 * @brief  Fills each SPI_InitStruct member with its default value.
 * @param  SPI_InitStruct: pointer to a SPI_InitTypeDef structure which will be initialized.
 * @retval None
 */
void SPI_StructInit(SPI_InitTypeDef* SPI_InitStruct) {
    /*--------------- Reset SPI init structure parameters values -----------------*/
    /* Initialize the SPI_Direction member */
    SPI_InitStruct->SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    /* initialize the SPI_Mode member */
    SPI_InitStruct->SPI_Mode = SPI_Mode_Slave;
    /* initialize the SPI_DataSize member */
    SPI_InitStruct->SPI_DataSize = SPI_DataSize_8b;
    /* Initialize the SPI_CPOL member */
    SPI_InitStruct->SPI_CPOL = SPI_CPOL_Low;
    /* Initialize the SPI_CPHA member */
    SPI_InitStruct->SPI_CPHA = SPI_CPHA_1Edge;
    /* Initialize the SPI_NSS member */
    SPI_InitStruct->SPI_NSS = SPI_NSS_Hard;
    /* Initialize the SPI_BaudRatePrescaler member */
    SPI_InitStruct->SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
    /* Initialize the SPI_FirstBit member */
    SPI_InitStruct->SPI_FirstBit = SPI_FirstBit_MSB;
    /* Initialize the SPI_CRCPolynomial member */
    SPI_InitStruct->SPI_CRCPolynomial = 7;
}

/**
 * @brief  Fills each I2S_InitStruct member with its default value.
 * @param  I2S_InitStruct: pointer to a I2S_InitTypeDef structure which will be initialized.
 * @retval None
 */
void I2S_StructInit(I2S_InitTypeDef* I2S_InitStruct) {
    /*--------------- Reset I2S init structure parameters values -----------------*/
    /* Initialize the I2S_Mode member */
    I2S_InitStruct->I2S_Mode = I2S_Mode_SlaveTx;

    /* Initialize the I2S_Standard member */
    I2S_InitStruct->I2S_Standard = I2S_Standard_Phillips;

    /* Initialize the I2S_DataFormat member */
    I2S_InitStruct->I2S_DataFormat = I2S_DataFormat_16b;

    /* Initialize the I2S_MCLKOutput member */
    I2S_InitStruct->I2S_MCLKOutput = I2S_MCLKOutput_Disable;

    /* Initialize the I2S_AudioFreq member */
    I2S_InitStruct->I2S_AudioFreq = I2S_AudioFreq_Default;

    /* Initialize the I2S_CPOL member */
    I2S_InitStruct->I2S_CPOL = I2S_CPOL_Low;
}

/**
 * @brief  Enables or disables the specified SPI peripheral.
 * @param  SPIx: where x can be 1, 2 or 3 to select the SPI peripheral.
 * @param  NewState: new state of the SPIx peripheral. 
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void SPI_Cmd(SPI_TypeDef* SPIx, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    if (NewState != DISABLE) {
        /* Enable the selected SPI peripheral */
        SPIx->CR1 |= SPI_CR1_SPE;
    } else {
        /* Disable the selected SPI peripheral */
        SPIx->CR1 &= (uint16_t) ~((uint16_t) SPI_CR1_SPE);
    }
}

/**
 * @brief  Enables or disables the specified SPI peripheral (in I2S mode).
 * @param  SPIx: where x can be 2 or 3 to select the SPI peripheral (or I2Sxext 
 *         for full duplex mode).
 * @param  NewState: new state of the SPIx peripheral. 
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void I2S_Cmd(SPI_TypeDef* SPIx, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_SPI_23_PERIPH_EXT(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

