ICinar/autebest_car/src/demos/car/app2/stm32f4xx_spi_bsp.c
    if (NewState != DISABLE) {
        /* Enable the selected SPI peripheral (in I2S mode) */
        SPIx->I2SCFGR |= SPI_I2SCFGR_I2SE;
    } else {
        /* Disable the selected SPI peripheral in I2S mode */
        SPIx->I2SCFGR &= (uint16_t) ~((uint16_t) SPI_I2SCFGR_I2SE);
    }
}

/**
 * @brief  Configures the data size for the selected SPI.
 * @param  SPIx: where x can be 1, 2 or 3 to select the SPI peripheral.
 * @param  SPI_DataSize: specifies the SPI data size.
 *          This parameter can be one of the following values:
 *            @arg SPI_DataSize_16b: Set data frame format to 16bit
 *            @arg SPI_DataSize_8b: Set data frame format to 8bit
 * @retval None
 */
void SPI_DataSizeConfig(SPI_TypeDef* SPIx, uint16_t SPI_DataSize) {
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_DATASIZE(SPI_DataSize));
    /* Clear DFF bit */
    SPIx->CR1 &= (uint16_t) ~SPI_DataSize_16b;
    /* Set new DFF bit value */
    SPIx->CR1 |= SPI_DataSize;
}

/**
 * @brief  Selects the data transfer direction in bidirectional mode for the specified SPI.
 * @param  SPIx: where x can be 1, 2 or 3 to select the SPI peripheral.
 * @param  SPI_Direction: specifies the data transfer direction in bidirectional mode. 
 *          This parameter can be one of the following values:
 *            @arg SPI_Direction_Tx: Selects Tx transmission direction
 *            @arg SPI_Direction_Rx: Selects Rx receive direction
 * @retval None
 */
void SPI_BiDirectionalLineConfig(SPI_TypeDef* SPIx, uint16_t SPI_Direction) {
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_DIRECTION(SPI_Direction));
    if (SPI_Direction == SPI_Direction_Tx) {
        /* Set the Tx only mode */
        SPIx->CR1 |= SPI_Direction_Tx;
    } else {
        /* Set the Rx only mode */
        SPIx->CR1 &= SPI_Direction_Rx;
    }
}

/**
 * @brief  Configures internally by software the NSS pin for the selected SPI.
 * @param  SPIx: where x can be 1, 2 or 3 to select the SPI peripheral.
 * @param  SPI_NSSInternalSoft: specifies the SPI NSS internal state.
 *          This parameter can be one of the following values:
 *            @arg SPI_NSSInternalSoft_Set: Set NSS pin internally
 *            @arg SPI_NSSInternalSoft_Reset: Reset NSS pin internally
 * @retval None
 */
void SPI_NSSInternalSoftwareConfig(SPI_TypeDef* SPIx, uint16_t SPI_NSSInternalSoft) {
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_NSS_INTERNAL(SPI_NSSInternalSoft));
    if (SPI_NSSInternalSoft != SPI_NSSInternalSoft_Reset) {
        /* Set NSS pin internally by software */
        SPIx->CR1 |= SPI_NSSInternalSoft_Set;
    } else {
        /* Reset NSS pin internally by software */
        SPIx->CR1 &= SPI_NSSInternalSoft_Reset;
    }
}

/**
 * @brief  Enables or disables the SS output for the selected SPI.
 * @param  SPIx: where x can be 1, 2 or 3 to select the SPI peripheral.
 * @param  NewState: new state of the SPIx SS output. 
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void SPI_SSOutputCmd(SPI_TypeDef* SPIx, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    if (NewState != DISABLE) {
        /* Enable the selected SPI SS output */
        SPIx->CR2 |= (uint16_t) SPI_CR2_SSOE;
    } else {
        /* Disable the selected SPI SS output */
        SPIx->CR2 &= (uint16_t) ~((uint16_t) SPI_CR2_SSOE);
    }
}

/**
 * @brief  Enables or disables the SPIx/I2Sx DMA interface.
 *   
 * @note   This function can be called only after the SPI_Init() function has 
 *         been called. 
 * @note   When TI mode is selected, the control bits SSM, SSI, CPOL and CPHA 
 *         are not taken into consideration and are configured by hardware
 *         respectively to the TI mode requirements.  
 * 
 * @param  SPIx: where x can be 1, 2 or 3 
 * @param  NewState: new state of the selected SPI TI communication mode.
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void SPI_TIModeCmd(SPI_TypeDef* SPIx, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        /* Enable the TI mode for the selected SPI peripheral */
        SPIx->CR2 |= SPI_CR2_FRF;
    } else {
        /* Disable the TI mode for the selected SPI peripheral */
        SPIx->CR2 &= (uint16_t) ~SPI_CR2_FRF;
    }
}

/**
 * @brief  Configures the full duplex mode for the I2Sx peripheral using its
 *         extension I2Sxext according to the specified parameters in the 
 *         I2S_InitStruct.
 * @param  I2Sxext: where x can be  2 or 3 to select the I2S peripheral extension block.
 * @param  I2S_InitStruct: pointer to an I2S_InitTypeDef structure that
 *         contains the configuration information for the specified I2S peripheral
 *         extension.
 * 
 * @note   The structure pointed by I2S_InitStruct parameter should be the same
 *         used for the master I2S peripheral. In this case, if the master is 
 *         configured as transmitter, the slave will be receiver and vice versa.
 *         Or you can force a different mode by modifying the field I2S_Mode to the
 *         value I2S_SlaveRx or I2S_SlaveTx indepedently of the master configuration.    
 *         
 * @note   The I2S full duplex extension can be configured in slave mode only.    
 *  
 * @retval None
 */
void I2S_FullDuplexConfig(SPI_TypeDef* I2Sxext, I2S_InitTypeDef* I2S_InitStruct) {
    uint16_t tmpreg = 0, tmp = 0;

    /* Check the I2S parameters */
    assert_param(IS_I2S_EXT_PERIPH(I2Sxext));
    assert_param(IS_I2S_MODE(I2S_InitStruct->I2S_Mode));
    assert_param(IS_I2S_STANDARD(I2S_InitStruct->I2S_Standard));
    assert_param(IS_I2S_DATA_FORMAT(I2S_InitStruct->I2S_DataFormat));
    assert_param(IS_I2S_CPOL(I2S_InitStruct->I2S_CPOL));

    /*----------------------- SPIx I2SCFGR & I2SPR Configuration -----------------*/
    /* Clear I2SMOD, I2SE, I2SCFG, PCMSYNC, I2SSTD, CKPOL, DATLEN and CHLEN bits */
    I2Sxext->I2SCFGR &= I2SCFGR_CLEAR_MASK;
    I2Sxext->I2SPR = 0x0002;

