ICinar/autebest_car/src/demos/car/app2/stm32f4xx_spi_bsp.c
    /* Enable the selected SPI CRC transmission */
    SPIx->CR1 |= SPI_CR1_CRCNEXT;
}

/**
 * @brief  Returns the transmit or the receive CRC register value for the specified SPI.
 * @param  SPIx: where x can be 1, 2 or 3 to select the SPI peripheral.
 * @param  SPI_CRC: specifies the CRC register to be read.
 *          This parameter can be one of the following values:
 *            @arg SPI_CRC_Tx: Selects Tx CRC register
 *            @arg SPI_CRC_Rx: Selects Rx CRC register
 * @retval The selected CRC register value..
 */
uint16_t SPI_GetCRC(SPI_TypeDef* SPIx, uint8_t SPI_CRC) {
    uint16_t crcreg = 0;
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_CRC(SPI_CRC));
    if (SPI_CRC != SPI_CRC_Rx) {
        /* Get the Tx CRC register */
        crcreg = SPIx->TXCRCR;
    } else {
        /* Get the Rx CRC register */
        crcreg = SPIx->RXCRCR;
    }
    /* Return the selected CRC register */
    return crcreg;
}

/**
 * @brief  Returns the CRC Polynomial register value for the specified SPI.
 * @param  SPIx: where x can be 1, 2 or 3 to select the SPI peripheral.
 * @retval The CRC Polynomial register value.
 */
uint16_t SPI_GetCRCPolynomial(SPI_TypeDef* SPIx) {
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    /* Return the CRC polynomial register */
    return SPIx->CRCPR;
}

/**
 * @}
 */

/** @defgroup SPI_Group4 DMA transfers management functions
 *  @brief   DMA transfers management functions
 *
@verbatim   
 ===============================================================================
                         DMA transfers management functions
 ===============================================================================  

@endverbatim
 * @{
 */

/**
 * @brief  Enables or disables the SPIx/I2Sx DMA interface.
 * @param  SPIx: To select the SPIx/I2Sx peripheral, where x can be: 1, 2 or 3 
 *         in SPI mode or 2 or 3 in I2S mode or I2Sxext for I2S full duplex mode. 
 * @param  SPI_I2S_DMAReq: specifies the SPI DMA transfer request to be enabled or disabled. 
 *          This parameter can be any combination of the following values:
 *            @arg SPI_I2S_DMAReq_Tx: Tx buffer DMA transfer request
 *            @arg SPI_I2S_DMAReq_Rx: Rx buffer DMA transfer request
 * @param  NewState: new state of the selected SPI DMA transfer request.
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void SPI_I2S_DMACmd(SPI_TypeDef* SPIx, uint16_t SPI_I2S_DMAReq, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH_EXT(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_SPI_I2S_DMAREQ(SPI_I2S_DMAReq));

    if (NewState != DISABLE) {
        /* Enable the selected SPI DMA requests */
        SPIx->CR2 |= SPI_I2S_DMAReq;
    } else {
        /* Disable the selected SPI DMA requests */
        SPIx->CR2 &= (uint16_t) ~SPI_I2S_DMAReq;
    }
}

/**
 * @}
 */

/** @defgroup SPI_Group5 Interrupts and flags management functions
 *  @brief   Interrupts and flags management functions
 *
@verbatim   
 ===============================================================================
                         Interrupts and flags management functions
 ===============================================================================  

  This section provides a set of functions allowing to configure the SPI Interrupts 
  sources and check or clear the flags or pending bits status.
  The user should identify which mode will be used in his application to manage 
  the communication: Polling mode, Interrupt mode or DMA mode. 
    
  Polling Mode
  =============
  In Polling Mode, the SPI/I2S communication can be managed by 9 flags:
     1. SPI_I2S_FLAG_TXE : to indicate the status of the transmit buffer register
     2. SPI_I2S_FLAG_RXNE : to indicate the status of the receive buffer register
     3. SPI_I2S_FLAG_BSY : to indicate the state of the communication layer of the SPI.
     4. SPI_FLAG_CRCERR : to indicate if a CRC Calculation error occur              
     5. SPI_FLAG_MODF : to indicate if a Mode Fault error occur
     6. SPI_I2S_FLAG_OVR : to indicate if an Overrun error occur
     7. I2S_FLAG_TIFRFE: to indicate a Frame Format error occurs.
     8. I2S_FLAG_UDR: to indicate an Underrun error occurs.
     9. I2S_FLAG_CHSIDE: to indicate Channel Side.

@note Do not use the BSY flag to handle each data transmission or reception.  It is
      better to use the TXE and RXNE flags instead.

  In this Mode it is advised to use the following functions:
     - FlagStatus SPI_I2S_GetFlagStatus(SPI_TypeDef* SPIx, uint16_t SPI_I2S_FLAG);
     - void SPI_I2S_ClearFlag(SPI_TypeDef* SPIx, uint16_t SPI_I2S_FLAG);

  Interrupt Mode
  ===============
  In Interrupt Mode, the SPI communication can be managed by 3 interrupt sources
  and 7 pending bits: 
  Pending Bits:
  ------------- 
     1. SPI_I2S_IT_TXE : to indicate the status of the transmit buffer register
     2. SPI_I2S_IT_RXNE : to indicate the status of the receive buffer register
     3. SPI_IT_CRCERR : to indicate if a CRC Calculation error occur (available in SPI mode only)            
     4. SPI_IT_MODF : to indicate if a Mode Fault error occur (available in SPI mode only)
     5. SPI_I2S_IT_OVR : to indicate if an Overrun error occur
     6. I2S_IT_UDR : to indicate an Underrun Error occurs (available in I2S mode only).
     7. I2S_FLAG_TIFRFE : to indicate a Frame Format error occurs (available in TI mode only).

  Interrupt Source:
  -----------------
     1. SPI_I2S_IT_TXE: specifies the interrupt source for the Tx buffer empty 
                        interrupt.  
     2. SPI_I2S_IT_RXNE : specifies the interrupt source for the Rx buffer not 
                          empty interrupt.
     3. SPI_I2S_IT_ERR : specifies the interrupt source for the errors interrupt.

  In this Mode it is advised to use the following functions:
     - void SPI_I2S_ITConfig(SPI_TypeDef* SPIx, uint8_t SPI_I2S_IT, FunctionalState NewState);
     - ITStatus SPI_I2S_GetITStatus(SPI_TypeDef* SPIx, uint8_t SPI_I2S_IT);
     - void SPI_I2S_ClearITPendingBit(SPI_TypeDef* SPIx, uint8_t SPI_I2S_IT);

  DMA Mode
  ========
  In DMA Mode, the SPI communication can be managed by 2 DMA Channel requests:
     1. SPI_I2S_DMAReq_Tx: specifies the Tx buffer DMA transfer request
     2. SPI_I2S_DMAReq_Rx: specifies the Rx buffer DMA transfer request

  In this Mode it is advised to use the following function:
    - void SPI_I2S_DMACmd(SPI_TypeDef* SPIx, uint16_t SPI_I2S_DMAReq, FunctionalState NewState);

@endverbatim
 * @{
 */

/**
 * @brief  Enables or disables the specified SPI/I2S interrupts.
 * @param  SPIx: To select the SPIx/I2Sx peripheral, where x can be: 1, 2 or 3 
 *         in SPI mode or 2 or 3 in I2S mode or I2Sxext for I2S full duplex mode. 
 * @param  SPI_I2S_IT: specifies the SPI interrupt source to be enabled or disabled. 
 *          This parameter can be one of the following values:
 *            @arg SPI_I2S_IT_TXE: Tx buffer empty interrupt mask
 *            @arg SPI_I2S_IT_RXNE: Rx buffer not empty interrupt mask
 *            @arg SPI_I2S_IT_ERR: Error interrupt mask
 * @param  NewState: new state of the specified SPI interrupt.
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void SPI_I2S_ITConfig(SPI_TypeDef* SPIx, uint8_t SPI_I2S_IT, FunctionalState NewState) {
    uint16_t itpos = 0, itmask = 0;

    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH_EXT(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_SPI_I2S_CONFIG_IT(SPI_I2S_IT));

