ICinar/autebest_car/src/demos/car/app2/stm32f4xx_spi_bsp.c
    /* Get the SPI IT index */
    itpos = SPI_I2S_IT >> 4;

    /* Set the IT mask */
    itmask = (uint16_t) 1 << (uint16_t) itpos;

    if (NewState != DISABLE) {
        /* Enable the selected SPI interrupt */
        SPIx->CR2 |= itmask;
    } else {
        /* Disable the selected SPI interrupt */
        SPIx->CR2 &= (uint16_t) ~itmask;
    }
}

/**
 * @brief  Checks whether the specified SPIx/I2Sx flag is set or not.
 * @param  SPIx: To select the SPIx/I2Sx peripheral, where x can be: 1, 2 or 3 
 *         in SPI mode or 2 or 3 in I2S mode or I2Sxext for I2S full duplex mode. 
 * @param  SPI_I2S_FLAG: specifies the SPI flag to check. 
 *          This parameter can be one of the following values:
 *            @arg SPI_I2S_FLAG_TXE: Transmit buffer empty flag.
 *            @arg SPI_I2S_FLAG_RXNE: Receive buffer not empty flag.
 *            @arg SPI_I2S_FLAG_BSY: Busy flag.
 *            @arg SPI_I2S_FLAG_OVR: Overrun flag.
 *            @arg SPI_FLAG_MODF: Mode Fault flag.
 *            @arg SPI_FLAG_CRCERR: CRC Error flag.
 *            @arg SPI_I2S_FLAG_TIFRFE: Format Error.
 *            @arg I2S_FLAG_UDR: Underrun Error flag.
 *            @arg I2S_FLAG_CHSIDE: Channel Side flag.  
 * @retval The new state of SPI_I2S_FLAG (SET or RESET).
 */
FlagStatus SPI_I2S_GetFlagStatus(SPI_TypeDef* SPIx, uint16_t SPI_I2S_FLAG) {
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH_EXT(SPIx));
    assert_param(IS_SPI_I2S_GET_FLAG(SPI_I2S_FLAG));

    /* Check the status of the specified SPI flag */
    if ((SPIx->SR & SPI_I2S_FLAG) != (uint16_t) RESET) {
        /* SPI_I2S_FLAG is set */
        bitstatus = SET;
    } else {
        /* SPI_I2S_FLAG is reset */
        bitstatus = RESET;
    }
    /* Return the SPI_I2S_FLAG status */
    return bitstatus;
}

/**
 * @brief  Clears the SPIx CRC Error (CRCERR) flag.
 * @param  SPIx: To select the SPIx/I2Sx peripheral, where x can be: 1, 2 or 3 
 *         in SPI mode or 2 or 3 in I2S mode or I2Sxext for I2S full duplex mode. 
 * @param  SPI_I2S_FLAG: specifies the SPI flag to clear. 
 *          This function clears only CRCERR flag.
 *            @arg SPI_FLAG_CRCERR: CRC Error flag.  
 *  
 * @note   OVR (OverRun error) flag is cleared by software sequence: a read 
 *          operation to SPI_DR register (SPI_I2S_ReceiveData()) followed by a read 
 *          operation to SPI_SR register (SPI_I2S_GetFlagStatus()).
 * @note   UDR (UnderRun error) flag is cleared by a read operation to 
 *          SPI_SR register (SPI_I2S_GetFlagStatus()).   
 * @note   MODF (Mode Fault) flag is cleared by software sequence: a read/write 
 *          operation to SPI_SR register (SPI_I2S_GetFlagStatus()) followed by a 
 *          write operation to SPI_CR1 register (SPI_Cmd() to enable the SPI).
 *  
 * @retval None
 */
void SPI_I2S_ClearFlag(SPI_TypeDef* SPIx, uint16_t SPI_I2S_FLAG) {
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH_EXT(SPIx));
    assert_param(IS_SPI_I2S_CLEAR_FLAG(SPI_I2S_FLAG));

    /* Clear the selected SPI CRC Error (CRCERR) flag */
    SPIx->SR = (uint16_t) ~SPI_I2S_FLAG;
}

/**
 * @brief  Checks whether the specified SPIx/I2Sx interrupt has occurred or not.
 * @param  SPIx: To select the SPIx/I2Sx peripheral, where x can be: 1, 2 or 3 
 *         in SPI mode or 2 or 3 in I2S mode or I2Sxext for I2S full duplex mode.  
 * @param  SPI_I2S_IT: specifies the SPI interrupt source to check. 
 *          This parameter can be one of the following values:
 *            @arg SPI_I2S_IT_TXE: Transmit buffer empty interrupt.
 *            @arg SPI_I2S_IT_RXNE: Receive buffer not empty interrupt.
 *            @arg SPI_I2S_IT_OVR: Overrun interrupt.
 *            @arg SPI_IT_MODF: Mode Fault interrupt.
 *            @arg SPI_IT_CRCERR: CRC Error interrupt.
 *            @arg I2S_IT_UDR: Underrun interrupt.  
 *            @arg SPI_I2S_IT_TIFRFE: Format Error interrupt.  
 * @retval The new state of SPI_I2S_IT (SET or RESET).
 */
ITStatus SPI_I2S_GetITStatus(SPI_TypeDef* SPIx, uint8_t SPI_I2S_IT) {
    ITStatus bitstatus = RESET;
    uint16_t itpos = 0, itmask = 0, enablestatus = 0;

    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH_EXT(SPIx));
    assert_param(IS_SPI_I2S_GET_IT(SPI_I2S_IT));

    /* Get the SPI_I2S_IT index */
    itpos = 0x01 << (SPI_I2S_IT & 0x0F);

    /* Get the SPI_I2S_IT IT mask */
    itmask = SPI_I2S_IT >> 4;

    /* Set the IT mask */
    itmask = 0x01 << itmask;

    /* Get the SPI_I2S_IT enable bit status */
    enablestatus = (SPIx->CR2 & itmask);

    /* Check the status of the specified SPI interrupt */
    if (((SPIx->SR & itpos) != (uint16_t) RESET) && enablestatus) {
        /* SPI_I2S_IT is set */
        bitstatus = SET;
    } else {
        /* SPI_I2S_IT is reset */
        bitstatus = RESET;
    }
    /* Return the SPI_I2S_IT status */
    return bitstatus;
}

/**
 * @brief  Clears the SPIx CRC Error (CRCERR) interrupt pending bit.
 * @param  SPIx: To select the SPIx/I2Sx peripheral, where x can be: 1, 2 or 3 
 *         in SPI mode or 2 or 3 in I2S mode or I2Sxext for I2S full duplex mode.  
 * @param  SPI_I2S_IT: specifies the SPI interrupt pending bit to clear.
 *         This function clears only CRCERR interrupt pending bit.   
 *            @arg SPI_IT_CRCERR: CRC Error interrupt.
 *   
 * @note   OVR (OverRun Error) interrupt pending bit is cleared by software 
 *          sequence: a read operation to SPI_DR register (SPI_I2S_ReceiveData()) 
 *          followed by a read operation to SPI_SR register (SPI_I2S_GetITStatus()).
 * @note   UDR (UnderRun Error) interrupt pending bit is cleared by a read 
 *          operation to SPI_SR register (SPI_I2S_GetITStatus()).   
 * @note   MODF (Mode Fault) interrupt pending bit is cleared by software sequence:
 *          a read/write operation to SPI_SR register (SPI_I2S_GetITStatus()) 
 *          followed by a write operation to SPI_CR1 register (SPI_Cmd() to enable 
 *          the SPI).
 * @retval None
 */
void SPI_I2S_ClearITPendingBit(SPI_TypeDef* SPIx, uint8_t SPI_I2S_IT) {
    uint16_t itpos = 0;
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH_EXT(SPIx));
    assert_param(IS_SPI_I2S_CLEAR_IT(SPI_I2S_IT));

    /* Get the SPI_I2S IT index */
    itpos = 0x01 << (SPI_I2S_IT & 0x0F);

    /* Clear the selected SPI CRC Error (CRCERR) interrupt pending bit */
    SPIx->SR = (uint16_t) ~itpos;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
